# Taps
tap "datadog-labs/pack"
tap "entireio/tap"
tap "felixkratz/formulae"
tap "oven-sh/bun"
tap "stakpak/stakpak"
tap "steipete/tap"

# Core CLI
brew "bash"
brew "git"
brew "gh"
brew "vim"
brew "neovim"
brew "tmux"
brew "jq"
brew "yq"
brew "wget"
brew "watch"
brew "fswatch"

# Modern CLI Replacements
brew "eza"                     # ls
brew "bat"                     # cat
brew "git-delta"               # git diff
brew "ripgrep"                 # grep (used by neovim Telescope)
brew "fd"                      # find
brew "fzf"                     # fuzzy finder
brew "zoxide"                  # cd
brew "mcfly"                   # shell history search
brew "yazi"                    # file manager
brew "trash-cli"               # safe rm
brew "television"              # fuzzy finder TUI
brew "z"                       # directory frecency

# Terminal UIs
brew "lazygit"
brew "lazydocker"
brew "btop"                    # system monitor
brew "circumflex"              # Hacker News TUI
brew "dive"                    # docker image explorer
brew "gdu"                     # disk usage analyzer

# Shell & Prompt
brew "starship"                # cross-shell prompt

# Languages & Runtimes
brew "asdf"
brew "nvm"
brew "oven-sh/bun/bun"
brew "pnpm"
brew "uv"                      # Python package manager

# AI Tools
brew "ollama"
brew "llm"
brew "llmfit"
brew "opencode"

# DevOps & Infra
brew "awscli"
brew "terraform"
brew "ansible"
brew "docker"
brew "docker-compose"
brew "colima"                  # Docker runtime for macOS
brew "sshuttle"
brew "syncthing"

# Security & Crypto
brew "age"                     # file encryption
brew "gnupg"
brew "pinentry-mac"

# Media
brew "ffmpeg"
brew "imagemagick"
brew "portaudio"
brew "asciinema"
brew "yt-dlp"                    # youtube-dl (maintained fork)

# Git & Dev Utilities
brew "biome"
brew "fastfetch"               # system info
brew "tree"
brew "whosthere"               # SSH server fingerprinting
brew "xcodegen"
brew "zellij"                  # terminal multiplexer
brew "magic-wormhole"          # file transfer

# Third-Party Tap Formulae
brew "datadog-labs/pack/pup"   # HTML CLI parser
brew "stakpak/stakpak/stakpak"
brew "steipete/tap/gogcli"

# macOS Casks
if OS.mac?
  cask "claude-code"
  cask "codex"
  cask "entireio/tap/entire"
end
